despachadorServices/target/classes/com/xml/entradaxml_soap_consultarfactura.xml

<?xml version="1.0" encoding="utf-8"?> 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.servicios.co/pagos/schemas">
   <soapenv:Body>
      <sch:ReferenciaFactura>
         <sch:referenciaFactura>||||</sch:referenciaFactura>
      </sch:ReferenciaFactura>
   </soapenv:Body>
</soapenv:Envelope>