despachadorServices/target/classes/com/xml/entradaxml_soap_pagarfactura.xml

<?xml version="1.0" encoding="utf-8"?> 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.servicios.co/pagos/schemas">
   <soapenv:Body>
      <sch:Pago>
         <sch:referenciaFactura>
            <sch:referenciaFactura>||||</sch:referenciaFactura>
         </sch:referenciaFactura>
         <sch:totalPagar>@@@</sch:totalPagar>
      </sch:Pago>
   </soapenv:Body>
</soapenv:Envelope>