templates/ConsultarSoap1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.servicios.co/pagos/schemas">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:ReferenciaFactura>
         <sch:referenciaFactura>${ref}</sch:referenciaFactura>
      </sch:ReferenciaFactura>
   </soapenv:Body>
</soapenv:Envelope>